Ran Plan for dir: `.` workspace: `default`

<details><summary>Show Output</summary>

```diff
Executando terraform plan


Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # aws_autoscaling_group.atlantis_ecs has changed
~ resource "aws_autoscaling_group" "atlantis_ecs" {
      + arn                       = "arn:aws:autoscaling:us-east-2:398963803929:autoScalingGroup:d4368f8c-4bba-4084-a982-1b6590b479ff:autoScalingGroupName/atlantis_ecs"
      ~ availability_zones        = [
          + "us-east-2a",
          + "us-east-2b",
          + "us-east-2c",
        ]
      + capacity_rebalance        = false
      + default_cooldown          = 300
      ~ desired_capacity          = 1 -> 0
      + enabled_metrics           = []
        id                        = "atlantis_ecs"
      + load_balancers            = []
      + max_instance_lifetime     = 0
      ~ max_size                  = 1 -> 0
      ~ min_size                  = 1 -> 0
        name                      = "atlantis_ecs"
      + service_linked_role_arn   = "arn:aws:iam::398963803929:role/aws-service-role/autoscaling.amazonaws.com/AWSServiceRoleForAutoScaling"
      + suspended_processes       = []
      + target_group_arns         = []
      + termination_policies      = []
        # (10 unchanged attributes hidden)


        # (3 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_autoscaling_attachment.asg_attachment_bar will be created
+ resource "aws_autoscaling_attachment" "asg_attachment_bar" {
      + alb_target_group_arn   = "arn:aws:elasticloadbalancing:us-east-2:398963803929:targetgroup/tg-ecs/8248864adeb13723"
      + autoscaling_group_name = (known after apply)
      + id                     = (known after apply)
    }

  # aws_autoscaling_group.atlantis_ecs is tainted, so must be replaced
-/+ resource "aws_autoscaling_group" "atlantis_ecs" {
      ~ arn                       = "arn:aws:autoscaling:us-east-2:398963803929:autoScalingGroup:d4368f8c-4bba-4084-a982-1b6590b479ff:autoScalingGroupName/atlantis_ecs" -> (known after apply)
      ~ availability_zones        = [
          - "us-east-2a",
          - "us-east-2b",
          - "us-east-2c",
        ] -> (known after apply)
      - capacity_rebalance        = false -> null
      ~ default_cooldown          = 300 -> (known after apply)
      ~ desired_capacity          = 0 -> 1
      - enabled_metrics           = [] -> null
      ~ id                        = "atlantis_ecs" -> (known after apply)
      - load_balancers            = [] -> null
      - max_instance_lifetime     = 0 -> null
      ~ max_size                  = 0 -> 1
      ~ min_size                  = 0 -> 1
        name                      = "atlantis_ecs"
      + name_prefix               = (known after apply)
      ~ service_linked_role_arn   = "arn:aws:iam::398963803929:role/aws-service-role/autoscaling.amazonaws.com/AWSServiceRoleForAutoScaling" -> (known after apply)
      - suspended_processes       = [] -> null
      - target_group_arns         = [] -> null
      - termination_policies      = [] -> null
        # (10 unchanged attributes hidden)


        # (3 unchanged blocks hidden)
    }

  # aws_launch_configuration.ubuntu_20_04 must be replaced
-/+ resource "aws_launch_configuration" "ubuntu_20_04" {
      ~ arn                              = "arn:aws:autoscaling:us-east-2:398963803929:launchConfiguration:feea6f96-0a51-4e73-a45c-d1c6ce8d653e:launchConfigurationName/atlantis_ecs" -> (known after apply)
      ~ ebs_optimized                    = false -> (known after apply)
      ~ id                               = "atlantis_ecs" -> (known after apply)
      ~ instance_type                    = "t2.micro" -> "t3.micro" # forces replacement
      + key_name                         = (known after apply)
        name                             = "atlantis_ecs"
      + name_prefix                      = (known after apply)
      - security_groups                  = [] -> null
      - vpc_classic_link_security_groups = [] -> null
        # (3 unchanged attributes hidden)

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + no_device             = (known after apply)
          + snapshot_id           = (known after apply)
          + throughput            = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = (known after apply)
          + http_put_response_hop_limit = (known after apply)
          + http_tokens                 = (known after apply)
        }

      + root_block_device {
          + delete_on_termination = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + throughput            = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }
    }

Plan: 3 to add, 0 to change, 2 to destroy.


```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d .`
* :put_litter_in_its_place: To **delete** this plan click [here](http://66992d035d8e:4141/lock?id=Matheus-SCosta%252FATLANTIS-ECS%252F.%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d .`
</details>

**Note: Objects have changed outside of Terraform**
Plan: 3 to add, 0 to change, 2 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
